//=============================================================================
//
// 弾処理 [bullet.h]
//
//=============================================================================
#pragma once

#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT Bullet_Initialize(void);
void Bullet_Finalize(void);
void Bullet_Update(void);
void Bullet_Draw(void);
void Bullet_Create(float x, float y, D3DXVECTOR2 dir);







